{"actor": "Vijay", "genres": ["action", "drama"], "plot": "A principled bus conductor is pushed into vigilantism when a land mafia threatens his township; he crafts legal traps and daring stunts to free the residents without losing his moral compass."}
{"actor": "Ajith Kumar", "genres": ["thriller", "heist"], "plot": "A retired hacker assembles a grudging crew to steal back evidence from a corrupt tycoon; the job spirals as an old rival on the police force anticipates every move, forcing a final double‑cross in a moving metro."}
{"actor": "Suriya", "genres": ["biopic", "drama"], "plot": "An aeronautics geek from a small town battles bureaucracy to start a low‑cost airline; with friends and his steadfast wife, he turns setbacks into runway lights guiding a daring first flight."}
{"actor": "Rajinikanth", "genres": ["mass", "action", "comedy"], "plot": "A witty jail warden cleans up a crime syndicate by turning prisoners into undercover helpers; one disguises the hero’s past, culminating in a festival‑day showdown with drumlines and flying veshtis."}
{"actor": "Kamal Haasan", "genres": ["spy", "political"], "plot": "A veteran intelligence officer uncovers a bio‑terror plot tied to his own protégé; he must choose between national duty and saving the young agent from becoming collateral damage."}
{"actor": "Vikram", "genres": ["neo-noir", "revenge"], "plot": "A sculptor with face‑blindness hunts a gang that ruined his family; he memorizes voices and footsteps, and carves a trap that uses echoes inside a coastal fort."}
{"actor": "Dhanush", "genres": ["romance", "coming‑of‑age"], "plot": "A record‑store clerk writes anonymous mixtapes to a medical student upstairs; their city grows loud with protests, and he must sing his truth on stage or lose her forever."}
{"actor": "Nayanthara", "genres": ["horror", "mystery"], "plot": "A lawyer inherits a beach bungalow where tides bring back objects from the night of a murder; she pieces together the case as the sea repeats clues every full moon."}
{"actor": "Vijay Sethupathi", "genres": ["dramedy", "sports"], "plot": "A failed bowler becomes a village cricket umpire; when a fixer targets a women’s league, he breaks his neutrality to teach underdogs how to exploit the rulebook."}
{"actor": "Trisha", "genres": ["family", "melodrama"], "plot": "An auditor returns to her ancestral home to divide property and finds her grandmother’s secret recipe notebook; she reconciles warring cousins by reviving the festival kitchen and an old love."}